//! [rec]
---- simd
<- pf =                           (-2, 2, 0, -0, inf, -inf, -nan, 1.5)
-> bs::rec(pf) =                  (-0.5, 0.5, inf, -inf, 0, -0, -nan, 0.666667)
<- pi =                           (-3, -2, -1, 0, 1, 2, 3, 4)
-> bs::rec(pi) =                  (0, 0, -1, 32767, 1, 0, 0, 0)
---- scalar
<- xf =                           5
-> bs::rec(xf) =                  0.2
<- xi =                           0
-> bs::rec(xi) =                  32767
<- yi =                           2
-> bs::rec(yi) =                  0
//! [rec]
